spec/fixtures/ups/ups_rates_with_modifiers_api_response.xml

<?xml version="1.0"?>
<RatingServiceSelectionResponse>
  <Response>
    <ResponseStatusCode>1</ResponseStatusCode>
    <ResponseStatusDescription>Success</ResponseStatusDescription>
  </Response>
  <RatedShipment>
    <Service>
      <Code>01</Code>
    </Service>
    <RatedShipmentWarning>Your invoice may vary from the displayed reference rates</RatedShipmentWarning>
    <BillingWeight>
      <UnitOfMeasurement>
        <Code>LBS</Code>
      </UnitOfMeasurement>
      <Weight>55.0</Weight>
    </BillingWeight>
    <TransportationCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>650.69</MonetaryValue>
    </TransportationCharges>
    <BaseServiceCharge>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </BaseServiceCharge>
    <ServiceOptionsCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </ServiceOptionsCharges>
    <TotalCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>650.69</MonetaryValue>
    </TotalCharges>
    <GuaranteedDaysToDelivery>1</GuaranteedDaysToDelivery>
    <ScheduledDeliveryTime/>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>482.57</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>405.33</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>72.74</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>482.57</MonetaryValue>
      </TotalCharges>
      <Weight>47.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>47.0</Weight>
      </BillingWeight>
    </RatedPackage>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>168.12</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>138.28</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>25.34</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>168.12</MonetaryValue>
      </TotalCharges>
      <Weight>4.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>8.0</Weight>
      </BillingWeight>
    </RatedPackage>
  </RatedShipment>
  <RatedShipment>
    <Service>
      <Code>12</Code>
    </Service>
    <RatedShipmentWarning>Your invoice may vary from the displayed reference rates</RatedShipmentWarning>
    <BillingWeight>
      <UnitOfMeasurement>
        <Code>LBS</Code>
      </UnitOfMeasurement>
      <Weight>55.0</Weight>
    </BillingWeight>
    <TransportationCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>222.10</MonetaryValue>
    </TransportationCharges>
    <BaseServiceCharge>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </BaseServiceCharge>
    <ServiceOptionsCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </ServiceOptionsCharges>
    <TotalCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>222.10</MonetaryValue>
    </TotalCharges>
    <GuaranteedDaysToDelivery>3</GuaranteedDaysToDelivery>
    <ScheduledDeliveryTime/>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>166.88</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>137.22</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>25.16</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>166.88</MonetaryValue>
      </TotalCharges>
      <Weight>47.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>47.0</Weight>
      </BillingWeight>
    </RatedPackage>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>55.22</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>42.40</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>8.32</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>55.22</MonetaryValue>
      </TotalCharges>
      <Weight>4.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>8.0</Weight>
      </BillingWeight>
    </RatedPackage>
  </RatedShipment>
  <RatedShipment>
    <Service>
      <Code>03</Code>
    </Service>
    <RatedShipmentWarning>Destination Modifier is applied on Package 1</RatedShipmentWarning>
    <RatedShipmentWarning>Destination Modifier is applied on Package 2</RatedShipmentWarning>
    <RatedShipmentWarning>Your invoice may vary from the displayed reference rates</RatedShipmentWarning>
    <BillingWeight>
      <UnitOfMeasurement>
        <Code>LBS</Code>
      </UnitOfMeasurement>
      <Weight>55.0</Weight>
    </BillingWeight>
    <TransportationCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>78.23</MonetaryValue>
    </TransportationCharges>
    <BaseServiceCharge>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </BaseServiceCharge>
    <ServiceOptionsCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </ServiceOptionsCharges>
    <TotalCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>78.23</MonetaryValue>
    </TotalCharges>
    <GuaranteedDaysToDelivery/>
    <ScheduledDeliveryTime/>
    <RatedPackage>
      <RateModifier>
        <ModifierType>DTM</ModifierType>
        <ModifierDesc>Destination Modifier</ModifierDesc>
        <Amount>-0.60</Amount>
      </RateModifier>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>54.18</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>43.03</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>7.25</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>54.18</MonetaryValue>
      </TotalCharges>
      <Weight>47.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>47.0</Weight>
      </BillingWeight>
    </RatedPackage>
    <RatedPackage>
      <RateModifier>
        <ModifierType>DTM</ModifierType>
        <ModifierDesc>Destination Modifier</ModifierDesc>
        <Amount>-0.60</Amount>
      </RateModifier>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>24.05</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>16.89</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>3.26</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>24.05</MonetaryValue>
      </TotalCharges>
      <Weight>4.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>8.0</Weight>
      </BillingWeight>
    </RatedPackage>
  </RatedShipment>
  <RatedShipment>
    <Service>
      <Code>14</Code>
    </Service>
    <RatedShipmentWarning>Your invoice may vary from the displayed reference rates</RatedShipmentWarning>
    <BillingWeight>
      <UnitOfMeasurement>
        <Code>LBS</Code>
      </UnitOfMeasurement>
      <Weight>55.0</Weight>
    </BillingWeight>
    <TransportationCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>721.35</MonetaryValue>
    </TransportationCharges>
    <BaseServiceCharge>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </BaseServiceCharge>
    <ServiceOptionsCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </ServiceOptionsCharges>
    <TotalCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>721.35</MonetaryValue>
    </TotalCharges>
    <GuaranteedDaysToDelivery>1</GuaranteedDaysToDelivery>
    <ScheduledDeliveryTime>2:00 P.M.</ScheduledDeliveryTime>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>517.90</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>435.33</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>78.07</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>517.90</MonetaryValue>
      </TotalCharges>
      <Weight>47.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>47.0</Weight>
      </BillingWeight>
    </RatedPackage>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>203.45</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>168.28</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>30.67</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>203.45</MonetaryValue>
      </TotalCharges>
      <Weight>4.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>8.0</Weight>
      </BillingWeight>
    </RatedPackage>
  </RatedShipment>
  <RatedShipment>
    <Service>
      <Code>02</Code>
    </Service>
    <RatedShipmentWarning>Your invoice may vary from the displayed reference rates</RatedShipmentWarning>
    <BillingWeight>
      <UnitOfMeasurement>
        <Code>LBS</Code>
      </UnitOfMeasurement>
      <Weight>55.0</Weight>
    </BillingWeight>
    <TransportationCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>316.42</MonetaryValue>
    </TransportationCharges>
    <BaseServiceCharge>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </BaseServiceCharge>
    <ServiceOptionsCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>0.00</MonetaryValue>
    </ServiceOptionsCharges>
    <TotalCharges>
      <CurrencyCode>USD</CurrencyCode>
      <MonetaryValue>316.42</MonetaryValue>
    </TotalCharges>
    <GuaranteedDaysToDelivery>2</GuaranteedDaysToDelivery>
    <ScheduledDeliveryTime/>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>242.79</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>201.69</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>36.60</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>242.79</MonetaryValue>
      </TotalCharges>
      <Weight>47.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>47.0</Weight>
      </BillingWeight>
    </RatedPackage>
    <RatedPackage>
      <TransportationCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>73.63</MonetaryValue>
      </TransportationCharges>
      <BaseServiceCharge>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>58.03</MonetaryValue>
      </BaseServiceCharge>
      <ServiceOptionsCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>0.00</MonetaryValue>
      </ServiceOptionsCharges>
      <ItemizedCharges>
        <Code>376</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>4.50</MonetaryValue>
        <SubType>Rural Extended</SubType>
      </ItemizedCharges>
      <ItemizedCharges>
        <Code>375</Code>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>11.10</MonetaryValue>
      </ItemizedCharges>
      <TotalCharges>
        <CurrencyCode>USD</CurrencyCode>
        <MonetaryValue>73.63</MonetaryValue>
      </TotalCharges>
      <Weight>4.0</Weight>
      <BillingWeight>
        <UnitOfMeasurement>
          <Code>LBS</Code>
        </UnitOfMeasurement>
        <Weight>8.0</Weight>
      </BillingWeight>
    </RatedPackage>
  </RatedShipment>
</RatingServiceSelectionResponse>